Project/Toir/src/Documents/торо_ПрисвоениеКвалификацийСотрудникам/торо_ПрисвоениеКвалификацийСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПрисвоениеКвалификацийСотрудникам</name>
  <registerRecords>InformationRegister.торо_КвалификацияРемонтногоПерсонала</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийСКвалификациями</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КвалификацииСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяОсновная</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Enums/торо_ВидыОперацийСКвалификациями/торо_ВидыОперацийСКвалификациями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыОперацийСКвалификациями</name>
  <enumValues>
    <name>ПрисвоениеКвалификаций</name>
  </enumValues>
  <enumValues>
    <name>УдалениеКвалификаций</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОсновноеИмяПользователяAD</name>
    <comment>TOIR20-731</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Documents/торо_ПрисвоениеКвалификацийСотрудникам/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			
			Объект.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяОрганизация",
			Истина);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
			
			Объект.Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновноеПодразделение",
			Истина);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
			
			Объект.Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнойОтветственный",
			Справочники.Пользователи.ПустаяСсылка());
			
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидОперации") Тогда
		Объект.ВидОперации = Параметры.ВидОперации;
	КонецЕсли;
	
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВнешнийВидФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	Для Каждого Строка Из Объект.КвалификацииСотрудников Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Квалификация) Тогда
			ШаблонСообщения = НСтр("es='¡Para el empleado %1 no es rellenada la calificación!';ru='Для сотрудника %1 не заполнена квалификация!';en='For employee%1 the qualification is not filled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.Сотрудник);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("es='¡El documento no es anotado!';ru='Документ не записан!';en='The document is not recorded!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.КвалификацииСотрудников.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.КвалификацииСотрудников.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияНачалоВыбораЗавершение",ЭтотОбъект, Новый Структура("Элемент",Элемент)),
						НСтр("es='¡La parte tabular del documento será limpiada! ¿Continuar?';ru='Табличная часть документа будет очищена! Продолжить?';en='The tabular part of the document will be cleared! Continue?'"), РежимДиалогаВопрос.ДаНет, 60);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКвалификацииСотрудников
&НаКлиенте
Процедура КвалификацииСотрудниковКвалификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.УдалениеКвалификаций") Тогда
		
		ТекДанные = Элементы.КвалификацииСотрудников.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекДанные.Сотрудник) Тогда
			ТекстСообщения = НСтр("es='¡Para la elección de la calificación quitada es necesario indicar al empleado!';ru='Для выбора удаляемой квалификации необходимо указать сотрудника!';en='To select a qualification to be deleted, an employee must be specified! '");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Элементы.КвалификацииСотрудников.ТекущийЭлемент = Элементы.КвалификацииСотрудниковСотрудник;
			Возврат;
		КонецЕсли;
		
		МассивКвалификаций = Новый Массив;
		МассивСтрок = Объект.КвалификацииСотрудников.НайтиСтроки(Новый Структура("Сотрудник", ТекДанные.Сотрудник));
		Для каждого Элем Из МассивСтрок Цикл
			
			МассивКвалификаций.Добавить(Элем.Квалификация);
			
		КонецЦикла;
		
		СписокВыбора = торо_ПроцедурыУправленияПерсоналом.ЗаполнитьСписокВыбораКвалификаций(ТекДанные.Сотрудник, Объект.Ссылка, Объект.Дата, ТекДанные.Квалификация, МассивКвалификаций);
		
		Элемент.СписокВыбора.Очистить();
		Для каждого Элем Из СписокВыбора Цикл
			Элемент.СписокВыбора.Добавить(Элем.Значение, Элем.Представление);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("es='¡Para la adición de los empleados es necesario escoger la organización!';ru='Для добавления сотрудников необходимо выбрать организацию!';en='To add employees, you must choose an organization!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Копирование Тогда
		Отказ = Истина;
		ТекДанные = Элементы.КвалификацииСотрудников.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		НС = Объект.КвалификацииСотрудников.Добавить();
		НС.Сотрудник = ТекДанные.Сотрудник;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.УдалениеКвалификаций") Тогда
		Возврат
	КонецЕсли;
	
	ТекДанные = Элементы.КвалификацииСотрудников.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.КвалификацииСотрудников.НайтиСтроки(Новый Структура("Сотрудник, Квалификация", ТекДанные.Сотрудник, ТекДанные.Квалификация)).Количество() > 1 Тогда
		Отказ = Истина;
		Если ОтменаРедактирования Тогда
			Объект.КвалификацииСотрудников.Удалить(ТекДанные);
		Иначе
			ШаблонСообщения = НСтр("es='¡En el documento dado al empleado %1 ya присваевается la calificación semejante!';ru='В данном документе сотруднику %1 уже присваевается подобная квалификация!';en='In this document, employee%1 is already assigned a similar qualification!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.Сотрудник);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковОсновнаяПриИзменении(Элемент)
	
	ТекДанные = Элементы.КвалификацииСотрудников.ТекущиеДанные;
		
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	Если ТекДанные.Основная Тогда
		
		МассивСтрок = Объект.КвалификацииСотрудников.НайтиСтроки(Новый Структура("Сотрудник, Основная", ТекДанные.Сотрудник, Истина));
		
		Если МассивСтрок.Количество() > 0 Тогда
			Для каждого Строка Из МассивСтрок Цикл
				Строка.Основная = Ложь;
			КонецЦикла; 
		КонецЕсли; 
		ТекДанные.Основная      = Истина;
КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Справочник.Сотрудники.ФормаВыбора", Новый Структура("РежимВыбора", Истина), Элемент, Объект.Ссылка);
	
	ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГоловнаяОрганизация");
	ЭлементОтбора.ПравоеЗначение = Объект.Организация;
	ЭлементОтбора.Использование = Истина;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковКвалификацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ТекДанные = Элементы.КвалификацииСотрудников.ТекущиеДанные;
		ТекДанные.Квалификация = ВыбранноеЗначение;
		ТекущаяОсновная = торо_ПроцедурыУправленияПерсоналом.ПолучитьОсновнуюКвалификацию(ТекДанные.Сотрудник, Объект.Ссылка, Объект.Дата);
		
		Если ВыбранноеЗначение = ТекущаяОсновная Тогда
			ТекДанные.Основная = Истина;
			Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.ПрисвоениеКвалификаций") Тогда
				ТекДанные.НоваяОсновная = ТекущаяОсновная;
			Иначе 
				ТекДанные.НоваяОсновная = торо_ПроцедурыУправленияПерсоналом.ПолучитьПредыдущуюОсновнуюКвалификацию(ТекДанные.Сотрудник, Объект.Ссылка, Объект.Дата);
			КонецЕсли;
		ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.УдалениеКвалификаций") Тогда
			ТекДанные.Основная = Ложь;
			ТекДанные.НоваяОсновная = ТекущаяОсновная;
		КонецЕсли;
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура УстановитьВнешнийВидФормы()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.ПрисвоениеКвалификаций") Тогда
		Элементы.КвалификацииСотрудниковКвалификация.Заголовок = НСтр("es='La calificación se apropiada';ru='Присваиваемая квалификация';en='Assigned qualification'");
		Элементы.КвалификацииСотрудниковКвалификация.РежимВыбораИзСписка = Ложь;
		Элементы.КвалификацииСотрудниковКвалификация.КнопкаСпискаВыбора = Ложь;
		Элементы.КвалификацииСотрудниковКвалификация.КнопкаВыбора = Истина;
		Элементы.КвалификацииСотрудниковОсновная.Доступность = Истина;
		Элементы.КвалификацииСотрудниковНоваяОсновная.Заголовок = НСтр("es='Corriente básica';ru='Текущая основная';en='Current main'");
		Элементы.КвалификацииСотрудниковНоваяОсновная.Доступность = Ложь;
	Иначе
		Элементы.КвалификацииСотрудниковКвалификация.Заголовок = НСтр("es='La calificación quitada';ru='Удаляемая квалификация';en='Deleted qualification'");
		Элементы.КвалификацииСотрудниковКвалификация.РежимВыбораИзСписка = Истина;
		Элементы.КвалификацииСотрудниковКвалификация.КнопкаСпискаВыбора = Истина;
		Элементы.КвалификацииСотрудниковКвалификация.КнопкаВыбора = Ложь;
		Элементы.КвалификацииСотрудниковОсновная.Доступность = Ложь;
		Элементы.КвалификацииСотрудниковНоваяОсновная.Заголовок = НСтр("es='Nuevo básica';ru='Новая основная';en='New main'");
		Элементы.КвалификацииСотрудниковНоваяОсновная.Доступность = Истина;
		ЭтаФорма.Заголовок = СтрЗаменить(ЭтаФорма.Заголовок, "Присвоение квалификаций сотрудникам", "Удаление квалификаций сотрудников");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	
		ОткрытьФорму("Справочник.Организации.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьТекущуюОсновную(СтрокаСотрудник = Неопределено)
	
	Если СтрокаСотрудник = Неопределено Тогда 
		СтрокаСотрудник = Элементы.КвалификацииСотрудников.ТекущиеДанные;
	КонецЕсли;
	
	Если СтрокаСотрудник <> Неопределено И ЗначениеЗаполнено(СтрокаСотрудник.Сотрудник) Тогда
			
		ТекОсновнаяКвалификация = торо_ПроцедурыУправленияПерсоналом.ПолучитьОсновнуюКвалификацию(СтрокаСотрудник.Сотрудник, Объект.Ссылка, Объект.Дата);
		СтрокаСотрудник.НоваяОсновная = ТекОсновнаяКвалификация;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковСотрудникПриИзменении(Элемент)
	ОпределитьТекущуюОсновную();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.УдалениеКвалификаций") Тогда
		ЭтаФорма.Заголовок = СтрЗаменить(ЭтаФорма.Заголовок, "Присвоение квалификаций сотрудникам", "Удаление квалификаций сотрудников");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Для каждого Строка Из Объект.КвалификацииСотрудников Цикл
		ОпределитьТекущуюОсновную(Строка);
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.УдалениеКвалификаций") Тогда
			Строка.Квалификация = ПредопределенноеЗначение("Справочник.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка");
			Строка.Основная = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");	
	
КонецПроцедуры


#КонецОбласти
